In [12]:
import pandas as pd

file = r"C:\Users\mkreidler\Desktop\Sample Tracking.csv"
df = pd.read_csv(file)
df = df[["Project", "Unit","Rhino"]]

df.head()

               Project Unit Rhino
0  111 WEST WASHINGTON   S1     Y
1  111 WEST WASHINGTON  S10     Y
2  111 WEST WASHINGTON   S2     Y
3  111 WEST WASHINGTON   S3     Y
4  111 WEST WASHINGTON   S4     Y

In [26]:
groups = df.groupby("Project").count().head()

In [30]:
df["Rhino"].value_counts()

Y    594
N     31
Name: Rhino, dtype: int64

In [33]:
df[df["Project"] == "111 WEST WASHINGTON" ].head()

               Project Unit Rhino  x
0  111 WEST WASHINGTON   S1     Y  5
1  111 WEST WASHINGTON  S10     Y  5
2  111 WEST WASHINGTON   S2     Y  5
3  111 WEST WASHINGTON   S3     Y  5
4  111 WEST WASHINGTON   S4     Y  5